app/controllers/articles_controller.rb

  def show
    @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE ("articles"."id" = 1) LIMIT 1

  def edit
    @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE ("articles"."id" = 1) LIMIT 1

  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("content", "created_at", "title", "updated_at") VALUES ('drama, ficcion', '2011-01-18 23:10:01.730367', 'la mama de la patata', '2011-01-18 23:10:01.730367')

  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])
---
SELECT "articles".* FROM "articles" WHERE ("articles"."id" = 2) LIMIT 1
UPDATE "articles" SET "content" = '', "title" = 'No more hello world!', "updated_at" = '2011-01-25 14:29:19.747421' WHERE ("articles"."id" = 1)

  def destroy
    @article = Article.find(params[:id])
    @article.destroy
---
SELECT "articles".* FROM "articles" WHERE ("articles"."id" = 2) LIMIT 1
DELETE FROM "articles" WHERE ("articles"."id" = 2)